In [22]:
import pandas as pd
import math

my_init_object = {
    "student": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "math": [85, 90, math.nan, 72, 88],
    "english": [92, 85, 76, 90, 89],
    "science": [78, 88, 67, math.nan, 95],
}

### make dataframe of the data

In [23]:
students_data = pd.DataFrame(my_init_object)
students_data

   student  math  english  science
0    Alice  85.0       92     78.0
1      Bob  90.0       85     88.0
2  Charlie   NaN       76     67.0
3    David  72.0       90      NaN
4      Eve  88.0       89     95.0

### Find and fill all missing values (NaN) with the value 0

In [3]:
students_data.replace("NaN", 0, inplace=True)
students_data.fillna(0, inplace=True)

students_data

NameError: name 'students_data' is not defined

### Calculate the average score for each student across all subjects. Add it as a new column Average

In [ ]:
students_data["average"] = students_data[students_data.columns[1:]].mean(axis=1)
students_data

   student  math  english  science    average
0    Alice  85.0       92     78.0  85.000000
1      Bob  90.0       85     88.0  87.666667
2  Charlie   0.0       76     67.0  47.666667
3    David  72.0       90      0.0  54.000000
4      Eve  88.0       89     95.0  90.666667

### Find the student(s) with the highest average score

In [38]:
max_a = students_data["average"].max()
students_data[students_data["average"] == max_a]

  student  math  english  science    average
4     Eve  88.0       89     95.0  90.666667

### Save the modified DataFrame into a new file called cleaned_grades.csv

In [39]:
students_data.to_csv("cleaned_grades.csv", index=False)

file: [cleaned_grades.csv](cleaned_grades.csv)